--- a/README.md
+++ b/README.md
@@ -54,34 +45,34 @@ toc::[]
 
 ### Proposed Architecture Diagram
 
-```plantuml
-@startuml
-actor DataEngineer as DE
-actor Researcher as R
 
-DE -> DatasetGenerationEngine : Create Dataset Request
-DatasetGenerationEngine -> DataIngestionPreprocessing : Access Preprocessed Data
-DataIngestionPreprocessing --> DatasetGenerationEngine : Data
-DatasetGenerationEngine -> AuditTrailService : Log Dataset Creation
-DatasetGenerationEngine -> AccessControl : Verify Access Permissions
-AccessControl --> DatasetGenerationEngine : Access Granted
-DatasetGenerationEngine -> DatasetDistributionModule : Request Dataset Distribution
+```mermaid
+sequenceDiagram
+    actor DE as Data Engineer
+    actor R as Researcher
+    
+    DE ->> DatasetGenerationEngine: Create Dataset Request
+    DatasetGenerationEngine ->> DataIngestionPreprocessing: Access Preprocessed Data
+    DataIngestionPreprocessing -->> DatasetGenerationEngine: Data
+    DatasetGenerationEngine ->> AuditTrailService: Log Dataset Creation
+    DatasetGenerationEngine ->> AccessControl: Verify Access Permissions
+    AccessControl -->> DatasetGenerationEngine: Access Granted
+    DatasetGenerationEngine ->> DatasetDistributionModule: Request Dataset Distribution
 
-DatasetDistributionModule -> AccessControl : Verify Distribution Permissions
-AccessControl --> DatasetDistributionModule : Access Granted
-DatasetDistributionModule -> ResearchEnv : Distribute Dataset
-DatasetDistributionModule -> AuditTrailService : Log Distribution Details
+    DatasetDistributionModule ->> AccessControl: Verify Distribution Permissions
+    AccessControl -->> DatasetDistributionModule: Access Granted
+    DatasetDistributionModule ->> ResearchEnv: Distribute Dataset
+    DatasetDistributionModule ->> AuditTrailService: Log Distribution Details
 
-R -> DatasetDistributionModule : Request Dataset Access
-DatasetDistributionModule -> AccessControl : Verify Access Permissions
-AccessControl --> DatasetDistributionModule : Access Granted
-DatasetDistributionModule -> AuditTrailService : Log Access Details
+    R ->> DatasetDistributionModule: Request Dataset Access
+    DatasetDistributionModule ->> AccessControl: Verify Access Permissions
+    AccessControl -->> DatasetDistributionModule: Access Granted
+    DatasetDistributionModule ->> AuditTrailService: Log Access Details
 
-R -> ResearchEnv : Access & Analyze Data
-ResearchEnv -> AuditTrailService : Log Researcher Access
-
-@enduml
+    R ->> ResearchEnv: Access & Analyze Data
+    ResearchEnv ->> AuditTrailService: Log Researcher Access
 ```
+
 
 ### Database Schema
